Backend/loadtest/k6/results/docker/guest/report-2026-07-29-215828.txt
     ✓ status is 201
     ✓ response has docId

     checks.........................: 100.00% ✓ 3498      ✗ 0   
     data_received..................: 668 kB  9.4 kB/s
     data_sent......................: 191 kB  2.7 kB/s
     http_req_blocked...............: avg=44.45µs  min=0s      med=0s      max=8.59ms   p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=34.54µs  min=0s      med=0s      max=2.97ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=42.8ms   min=33.36ms med=39.65ms max=670.68ms p(90)=46.31ms  p(95)=56.48ms 
       { expected_response:true }...: avg=42.8ms   min=33.36ms med=39.65ms max=670.68ms p(90)=46.31ms  p(95)=56.48ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 1749
     http_req_receiving.............: avg=138.09µs min=0s      med=0s      max=2.34ms   p(90)=585.08µs p(95)=659.59µs
     http_req_sending...............: avg=13.73µs  min=0s      med=0s      max=1.81ms   p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=42.65ms  min=33.36ms med=39.51ms max=670.68ms p(90)=46.19ms  p(95)=56.32ms 
     http_reqs......................: 1749    24.713437/s
     iteration_duration.............: avg=1.04s    min=1.03s   med=1.04s   max=1.67s    p(90)=1.04s    p(95)=1.05s   
     iterations.....................: 1749    24.713437/s
     vus............................: 5       min=1       max=50
     vus_max........................: 50      min=50      max=50